Revit 2027 API
FamilyItemFactory.NewReferencePoint(PointElementReference) Method
Create a reference point on an existing reference in an Autodesk Revit family document.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferencePoint NewReferencePoint(
	PointElementReference A_0
)
Public Function NewReferencePoint (
	A_0 As PointElementReference
) As ReferencePoint
public:
ReferencePoint^ NewReferencePoint(
	PointElementReference^ A_0
)
member NewReferencePoint :
        A_0 : PointElementReference -> ReferencePoint
Parameters
A_0 PointElementReference
Return Value
ReferencePoint
The newly created ReferencePoint.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the argument is null.
InvalidOperationException |  Thrown when the family is not a Conceptual Mass Family.
Remarks
The location and coordinate system of the point is determined by the particular PointReference subclass, and the point will remain constrained to that reference.
See Also
Reference
FamilyItemFactory Class
NewReferencePoint Overload
Autodesk.Revit.Creation Namespace